# CIA World SQL Project

- The goal of this project is to show how to use various SQL queries to select specific data from a given dataset

In [4]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

First, I Look at the first five rows of each column to become familiar with the data set that I'm working with:

In [6]:
%%sql

SELECT * FROM facts
LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Here, I use a single query to return the minimum population, maximum population, minimum population growth, and maximum population growth to get a statistics summary:

In [7]:
%%sql

SELECT 
    MIN(population) AS min_pop,
    MAX(population) AS max_pop,
    MIN(population_growth) AS min_pop_growth,
    MAX(population_growth) max_pop_growth 
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

Next, I write a query that returns the country with the minimum population:

In [8]:
%%sql

SELECT * FROM facts
WHERE population == (
    SELECT
    MIN(population)
    FROM facts
);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

And a query that returns the country with the maximum population:

In [9]:
%%sql

SELECT * FROM facts
WHERE population == (
    SELECT MAX(population)
    FROM facts
);

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

Below, I recompute the statistics summary while excluding the row for the whole world:

In [16]:
%%sql

SELECT MIN(population) AS min_pop,
       MAX(population) AS max_pop,
       MIN(population_growth) AS min_pop_growth,
       MAX(population_growth) AS max_pop_growth 
FROM facts
WHERE name != 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

Then I calculate the average value for the population and area columns:

In [17]:
%%sql

SELECT
AVG(population) AS avg_population,
AVG(area) AS avg_area
FROM facts
WHERE name != 'World';

Done.

[(32242666.56846473, 555093.546184739)]

The cell below shows a query that finds all of the countries where the population is above average and the area is below average:

In [19]:
%%sql

SELECT * FROM facts
WHERE population > (
    SELECT AVG(population)
    FROM facts
    WHERE name != 'World'
)
AND area < (
    SELECT AVG(area)
    FROM facts
    WHERE name != 'World'
);

Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

Conclusion:

SQL Queries make it very easy to navigate through data sets.